SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32SPIN0260/MM32SPIN0260_Bootloader/Device/MM32SPIN0260/Include/reg_exti.h
/**
  * @brief EXTI_DFLTW Register Bit Definition
  */
#define  EXTI_DFLTW_FILTER0_SEL_Pos               (0)
#define  EXTI_DFLTW_FILTER0_SEL_Msk               (0x3U << EXTI_DFLTW_FILTER0_SEL_Pos)              /*!<FILTER0_Select: Built-in Filter Pulse Width:?*/
#define  EXTI_DFLTW_FILTER0_SEL                   EXTI_DFLTW_FILTER0_SEL_Msk
#define  EXTI_DFLTW_FILTER0_SEL_Bit0              (0x1U << EXTI_DFLTW_FILTER0_SEL_Pos) 
#define  EXTI_DFLTW_FILTER0_SEL_Bit1              (0x2U << EXTI_DFLTW_FILTER0_SEL_Pos) 
#define  EXTI_DFLTW_FILTER1_SEL_Pos               (2)
#define  EXTI_DFLTW_FILTER1_SEL_Msk               (0x3U << EXTI_DFLTW_FILTER1_SEL_Pos)              /*!<FILTER1_Select: Built-in Filter Pulse Width:?*/
#define  EXTI_DFLTW_FILTER1_SEL                   EXTI_DFLTW_FILTER1_SEL_Msk
#define  EXTI_DFLTW_FILTER1_SEL_Bit0              (0x1U << EXTI_DFLTW_FILTER1_SEL_Pos) 
#define  EXTI_DFLTW_FILTER1_SEL_Bit1              (0x2U << EXTI_DFLTW_FILTER1_SEL_Pos) 

/**
  * @brief EXTI_DFLTMUX Register Bit Definition
  */
#define  EXTI_DFLTMUX_FILTER0_MUX_Pos             (0)
#define  EXTI_DFLTMUX_FILTER0_MUX_Msk             (0xFU << EXTI_DFLTMUX_FILTER0_MUX_Pos)            /*!<FILTER0_MUX*/
#define  EXTI_DFLTMUX_FILTER0_MUX                 EXTI_DFLTMUX_FILTER0_MUX_Msk
#define  EXTI_DFLTMUX_FILTER0_MUX_Bit0            (0x1U << EXTI_DFLTMUX_FILTER0_MUX_Pos) 
#define  EXTI_DFLTMUX_FILTER0_MUX_Bit1            (0x2U << EXTI_DFLTMUX_FILTER0_MUX_Pos) 
#define  EXTI_DFLTMUX_FILTER0_MUX_Bit2            (0x4U << EXTI_DFLTMUX_FILTER0_MUX_Pos) 
#define  EXTI_DFLTMUX_FILTER0_MUX_Bit3            (0x8U << EXTI_DFLTMUX_FILTER0_MUX_Pos) 
#define  EXTI_DFLTMUX_FILTER1_MUX_Pos             (4)
#define  EXTI_DFLTMUX_FILTER1_MUX_Msk             (0xFU << EXTI_DFLTMUX_FILTER1_MUX_Pos)            /*!<FILTER1_MUX*/
#define  EXTI_DFLTMUX_FILTER1_MUX                 EXTI_DFLTMUX_FILTER1_MUX_Msk
#define  EXTI_DFLTMUX_FILTER1_MUX_Bit0            (0x1U << EXTI_DFLTMUX_FILTER1_MUX_Pos) 
#define  EXTI_DFLTMUX_FILTER1_MUX_Bit1            (0x2U << EXTI_DFLTMUX_FILTER1_MUX_Pos) 
#define  EXTI_DFLTMUX_FILTER1_MUX_Bit2            (0x4U << EXTI_DFLTMUX_FILTER1_MUX_Pos) 
#define  EXTI_DFLTMUX_FILTER1_MUX_Bit3            (0x8U << EXTI_DFLTMUX_FILTER1_MUX_Pos) 


#endif

